# Test evaluation task suite for AI data designer

Setup API key to run tests below

In [2]:
import sys
import os

# Define the root directory and add it to the path
notebook_dir = os.getcwd()
root_dir = os.path.abspath(os.path.join(notebook_dir, '..', '..', '..'))
sys.path.insert(0, root_dir)

# set environment variable 'GRETEL_PROD_API_KEY' from https://console.gretel.ai/users/me/key
gretel_prod_api_key = input("Enter your Gretel API key from https://console.gretel.ai/users/me/key: ")
os.environ['GRETEL_PROD_API_KEY'] = gretel_prod_api_key

### Evaluate Synthetic Dataset

In [13]:
# Reload packages if you've made changes to the evaluation.py file.
# Alternatively you can restart the kernel to pick up changes

from importlib import reload
import evaluation
reload(evaluation)

import pandas as pd
from pprint import pprint
from navigator_helpers.llms.llm_suite import GretelLLMSuite
from evaluation import BaseEvaluationTaskSuite, NL2PythonEvaluationTaskSuite, NL2SQLEvaluationTaskSuite
from datasets import load_dataset

In [14]:
datasets_dict = {
    "synthetic_text_to_sql": {
        "dataset_kwargs": {
            "path": "gretelai/synthetic_text_to_sql",
            "split": "train"
        },
        "code_lang": "sql",
        "eval_kwargs":{
            "instruction_col_name": "sql_prompt",
            "code_col_name": "sql",
            "context_col_name": "sql_context"
        }
    },
    "gsm8k": {
        "dataset_kwargs": {
            "path": "openai/gsm8k",
            "name": "main",
            "split": "train"
        },
        "eval_kwargs": {
            "instruction_col_name": "question",
            "code_col_name": "answer",
        }
    },
    "synthetic_gsm8k": {
        "dataset_kwargs": {
            "path": "gretelai/synthetic-gsm8k-reflection-405b",
            "split": "train"
        },
        "eval_kwargs": {
            "instruction_col_name": "question",
            "code_col_name": "answer",
        }
    },
    "xlcost_text_to_code": {
        "dataset_kwargs": {
            "path": "codeparrot/xlcost-text-to-code",
            "split": "train"
        },
        "code_lang": "python",
        "eval_kwargs": {
            "instruction_col_name": "text",
            "code_col_name": "code",
        }
    },
}

# Prompt user to select a dataset
print("Available datasets:")
for key in datasets_dict.keys():
    print(f" - {key}")

selected_dataset = input("\nEnter the name of the dataset to load: ").strip()

# Load the selected dataset
if selected_dataset in datasets_dict:
    dataset_dict = datasets_dict[selected_dataset]
    eval_kwargs = dataset_dict["eval_kwargs"]
    code_lang = dataset_dict["code_lang"] if "code_lang" in dataset_dict.keys() else None
    dataset = load_dataset(**dataset_dict["dataset_kwargs"])
    
    # Optionally, select a subset and convert to pandas DataFrame
    dataset_1000 = dataset.select(range(1000))
    dataset_1000_pd = dataset_1000.to_pandas()
    
    print(f"Loaded dataset '{selected_dataset}' successfully!")
else:
    print("Error: Dataset not found. Please enter a valid dataset name.")

Available datasets:
 - synthetic_text_to_sql
 - gsm8k
 - synthetic_gsm8k
 - xlcost_text_to_code
Loaded dataset 'synthetic_text_to_sql' successfully!

In [15]:
llm_suite = GretelLLMSuite()

2024-10-09 23:09:37.538 - INFO - ü¶ú Initializing LLM suite
2024-10-09 23:09:37.540 - INFO - üìñ Natural language LLM: gretelai-mistral-nemo-2407
2024-10-09 23:09:37.541 - INFO - üíª Code LLM: gretelai-mistral-nemo-2407
2024-10-09 23:09:37.542 - INFO - ‚öñÔ∏è Judge LLM: gretelai-mistral-nemo-2407

In [16]:
results_1 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).row_uniqueness()
pprint(results_1)

{'non_semantically_unique_ids': [(2, 905), (78, 595), (192, 939), (272, 378)],
 'non_unique_ids': [],
 'percent_semantically_unique': 99.6,
 'percent_unique': 100.0}

In [17]:

results_2 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).feature_cardinality()
pprint(results_2)

{'domain': 0.1,
 'domain_description': 0.1,
 'id': 1.0,
 'sql': 1.0,
 'sql_complexity': 0.008,
 'sql_complexity_description': 0.008,
 'sql_context': 0.996,
 'sql_explanation': 1.0,
 'sql_prompt': 1.0,
 'sql_task_type': 0.004,
 'sql_task_type_description': 0.004}

In [18]:

results_3 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).feature_distribution()
pprint(results_3)

({'domain': {'aerospace': 6,
             'agriculture': 8,
             'aquaculture': 15,
             'archeology': 8,
             'arctic research': 4,
             'artificial intelligence': 12,
             'arts and culture': 8,
             'arts operations and management': 15,
             'automotive': 16,
             'beauty industry': 11,
             'biotechnology': 11,
             'blockchain': 6,
             'cannabis industry': 7,
             'charitable organizations': 15,
             'chemicals': 9,
             'civil engineering': 9,
             'climate change': 12,
             'construction': 17,
             'cosmetics': 4,
             'cultural preservation': 8,
             'cybersecurity': 13,
             'defense contractors': 5,
             'defense industry': 9,
             'defense operations': 13,
             'defense security': 16,
             'disability services': 11,
             'education': 9,
             'energy': 8,
             'entertainment industry': 9,
             'ethical fashion': 18,
             'fashion': 7,
             'fashion retail': 7,
             'finance': 8,
             'financial services': 12,
             'fine arts': 14,
             'fitness industry': 19,
             'food industry': 15,
             'food services': 10,
             'forestry': 9,
             'gaming industry': 7,
             'gaming technology': 14,
             'government policy': 15,
             'government services': 13,
             'healthcare': 13,
             'higher education': 15,
             'hospitality': 9,
             'hospitality technology': 10,
             'human resources': 9,
             'humanitarian aid': 4,
             'insurance': 5,
             'journalism': 8,
             'justice': 6,
             'legal services': 7,
             'logistics': 10,
             'manufacturing': 13,
             'marine biology': 6,
             'maritime': 6,
             'media': 11,
             'mental health': 9,
             'mining industry': 7,
             'mining operations': 10,
             'museums': 10,
             'music': 6,
             'music industry': 5,
             'nonprofit': 9,
             'nonprofit operations': 9,
             'ocean shipping': 9,
             'oceanography': 13,
             'oceans': 9,
             'oil and gas': 12,
             'pharmaceuticals': 6,
             'philanthropy': 11,
             'precision agriculture': 10,
             'public health': 16,
             'public safety': 11,
             'public transportation': 11,
             'rare earth elements': 8,
             'real estate': 15,
             'restaurant operations': 18,
             'retail': 11,
             'rural development': 14,
             'rural health': 12,
             'social impact investing': 3,
             'social media': 4,
             'space': 17,
             'space exploration': 5,
             'sports': 11,
             'sports entertainment': 8,
             'startups': 5,
             'sustainable energy': 8,
             'sustainable infrastructure': 16,
             'technology': 5,
             'telecommunications': 9,
             'tourism': 6,
             'trade unions': 8,
             'transportation': 11,
             'venture capital': 10,
             'waste management': 16,
             'water resources': 5,
             'wildlife conservation': 8},
  'domain_description': {'AI data on algorithmic fairness, AI safety, explainable AI, and creative AI applications.': 12,
                         'Agricultural innovation metrics, rural infrastructure projects, community development initiatives, and economic diversification efforts.': 14,
                         'Aircraft manufacturing data, satellite deployment projects, flight safety records, and space exploration research.': 6,
                         'Animal population data, habitat preservation efforts, and community education programs.': 8,
                         'Aquatic farming data, fish stock management, ocean health metrics, and sustainable seafood trends.': 15,
                         'Audience demographics, event attendance, program impact, and funding sources.': 8,
                         'Audience demographics, viewership trends, content ratings, production budgets, and marketing strategies for movies, TV shows, and music.': 9,
                         'Building permit data, construction labor statistics, project timeline information, and sustainable building practices.': 17,
                         'Cannabis production data, dispensary sales stats, regulatory compliance metrics, and social equity trends.': 7,
                         'Case outcomes, legal precedents, attorney performance metrics, client demographics, and billing information.': 7,
                         'Chemical manufacturing data, safety protocols, environmental impact assessments, and product innovation metrics.': 9,
                         'Climate change data on climate mitigation, climate adaptation, climate finance, and climate communication.': 12,
                         'Clinical trial outcomes, drug approval data, sales figures, R&D expenditures, and market access strategies.': 6,
                         'Community health statistics, infectious disease tracking data, healthcare access metrics, and public health policy analysis.': 16,
                         'Company founding data, funding records, diversity metrics, and innovation trends.': 5,
                         'Company founding data, investment rounds, exit strategies, and diversity metrics in the startup ecosystem.': 10,
                         'Comprehensive data on agroecology, food justice, indigenous food systems, and urban agriculture.': 8,
                         'Comprehensive data on disability accommodations, support programs, policy advocacy, and inclusion efforts in disability services.': 11,
                         'Comprehensive data on marine species, oceanography, conservation efforts, and climate change impacts in marine biology.': 6,
                         'Comprehensive data on smart contracts, decentralized applications, digital assets, and regulatory frameworks in blockchain.': 6,
                         'Comprehensive data on sustainable forest management, timber production, wildlife habitat, and carbon sequestration in forestry.': 9,
                         'Consumer preference data, ingredient sourcing information, product safety records, and cruelty-free certification metrics.': 4,
                         'Cosmetics sales data, beauty product ingredient transparency, consumer preferences, and sustainability metrics.': 11,
                         'Crime statistics, emergency response times, community policing metrics, and disaster preparedness data.': 11,
                         'Data on art collections, cultural event attendance, artist demographics, museum operations, and heritage preservation efforts.': 15,
                         'Defense contract data, military equipment maintenance, threat intelligence metrics, and veteran employment stats.': 9,
                         'Defense data on military innovation, peacekeeping operations, defense diplomacy, and humanitarian assistance.': 13,
                         'Detailed financial data including investment strategies, risk management, fraud detection, customer analytics, and regulatory compliance.': 12,
                         'Detailed records on cargo handling, fleet management, port operations, and regulatory compliance in ocean shipping.': 9,
                         'Detailed records on ethical manufacturing, circular economy, workforce development, and industry 4.0.': 13,
                         'Detailed records on excavation sites, artifact analysis, historical context, and public outreach in archeology.': 8,
                         'Detailed records on healthcare access, disease prevalence, and resource allocation in rural health.': 12,
                         'Detailed records on investment strategies, risk assessment, impact measurement, and ESG (Environmental, Social, and Governance) factors in social impact investing.': 3,
                         'Detailed records on military technology, intelligence operations, national security, and cybersecurity strategies.': 16,
                         'Detailed records on music creation, distribution, marketing, and consumption patterns across various genres and platforms.': 6,
                         'Donation records, program outcomes, volunteer engagement metrics, budget reports, and community impact assessments.': 9,
                         'Education data on student mental health, teacher professional development, open pedagogy, and lifelong learning.': 9,
                         'Employee demographics, talent acquisition data, diversity and inclusion metrics, and training program statistics.': 9,
                         'Energy market data covering renewable energy sources, energy storage, carbon pricing, and energy efficiency.': 8,
                         'Exploration data, production figures, infrastructure development, and market trends.': 12,
                         'Extensive data on athlete performance, team management, fan engagement, facility operations, and event planning in sports.': 11,
                         'Extensive data on disaster response, refugee support, community development, and advocacy in humanitarian aid.': 4,
                         'Extensive data on ethical AI, technology for social good, digital divide, and technology accessibility.': 5,
                         'Extensive data on route planning, fare collection, vehicle maintenance, and accessibility in public transportation.': 11,
                         'Extensive data on sustainable materials, fair labor practices, circular economy, and consumer awareness in ethical fashion.': 18,
                         'Extensive data on user behavior, content trends, advertising performance, and data privacy in social media.': 4,
                         'Fashion trend data, textile sourcing info, customer size diversity, and sustainable fashion metrics.': 7,
                         'Financial data on Shariah-compliant finance, socially responsible lending, financial capability, and financial wellbeing.': 8,
                         'Financial data, program impact, donor demographics, and volunteer management.': 15,
                         'Food safety records, nutrition data, supply chain transparency, and sustainable food trends.': 15,
                         'Freight forwarding data, warehouse management statistics, route optimization information, and reverse logistics metrics.': 10,
                         'Genetic research data, bioprocess engineering information, biotech startup funding, and biosensor technology development.': 11,
                         'Government data on open data initiatives, public participation, evidence-based policy making, and government transparency.': 15,
                         'Graduate student records, research grant data, academic publishing statistics, and faculty diversity metrics.': 15,
                         'Green building data, renewable energy infrastructure projects, carbon offset initiatives, and smart city technology adoption.': 16,
                         'Healthcare data on mental health parity, cultural competency, health equity metrics, and community health workers.': 13,
                         'Hospitality data on sustainable tourism, cultural heritage preservation, virtual tourism, and local economic impact.': 9,
                         'Hotel tech adoption metrics, online travel agency data, virtual tour engagement stats, and hospitality AI trends.': 10,
                         'In-depth data on art history, curation, exhibition, and cultural impact in the fine arts.': 14,
                         'In-depth data on climate change, biodiversity, indigenous communities, and resource management in arctic research.': 4,
                         'In-depth data on heritage sites, traditional arts, language preservation, and community engagement in cultural preservation.': 8,
                         'In-depth data on mental health conditions, treatment approaches, patient outcomes, and public awareness campaigns in mental health.': 9,
                         'Infrastructure development data, engineering design standards, public works project information, and resilience metrics.': 9,
                         'International visitor statistics, travel advisory information, destination marketing data, and sustainable tourism practices.': 6,
                         'Justice data on restorative justice, access to justice, criminal justice reform, and legal technology.': 6,
                         'Marine life research data, ocean floor mapping projects, pollution control initiatives, and maritime law compliance.': 13,
                         'Media data on content diversity, media literacy, disinformation detection, and media representation.': 11,
                         'Menu engineering, customer preferences, inventory management, and sustainability initiatives.': 10,
                         'Military equipment sales data, defense project timelines, contract negotiations, and geopolitical risk assessments.': 5,
                         'Mineral extraction statistics, environmental impact assessments, labor productivity metrics, and geological survey information.': 7,
                         'Mining operation data, environmental impact stats, workforce diversity, and resource depletion metrics.': 10,
                         'Mobile and broadband subscriber data, network infrastructure investments, customer usage patterns, and regulatory compliance information.': 9,
                         'Music streaming data, concert ticket sales, artist demographics, and music festival trends.': 5,
                         'News reporting data, audience demographics, media ethics information, and investigative journalism projects.': 8,
                         'Nonprofit data on charitable giving trends, social impact assessment, capacity building, and volunteer management.': 9,
                         'Ocean data on marine conservation, ocean acidification, deep-sea exploration, and maritime safety.': 9,
                         'Philanthropy data on effective altruism, impact investing, philanthropic trends, and donor demographics.': 11,
                         'Player analytics, game performance metrics, eSports data, and virtual reality trends.': 7,
                         'Player demographics, game design data, esports event information, and virtual reality technology adoption.': 14,
                         'Precision farming data, satellite imagery analysis, IoT sensor metrics, and agricultural automation trends.': 10,
                         'Public service delivery, budget allocation, citizen feedback, and policy impact.': 13,
                         'Rare earth element production data, market trends, environmental impact stats, and supply chain transparency.': 8,
                         'Real estate data on inclusive housing policies, sustainable urbanism, property co-ownership, and housing affordability.': 15,
                         'Renewable energy project data, energy efficiency stats, carbon offset programs, and clean energy policy trends.': 8,
                         'Restaurant revenue data, menu engineering information, food safety inspection records, and sustainable sourcing practices.': 18,
                         'Retail data on circular supply chains, ethical labor practices, product transparency, and consumer education.': 11,
                         'Space data on space exploration, satellite technology, space debris mitigation, and astrobiology.': 17,
                         'Spacecraft manufacturing data, space mission records, astronaut medical data, and astrophysics research.': 5,
                         'Sports team performance data, fan demographics, ticket sales statistics, and athlete wellbeing programs.': 8,
                         'Threat intelligence data, vulnerability assessments, security incident response metrics, and cybersecurity policy analysis.': 13,
                         'Transportation data on electric vehicle adoption, autonomous vehicles, public transportation systems, and multimodal mobility.': 11,
                         'Trend forecasting data, garment manufacturing information, retail sales statistics, and sustainability metrics in the industry.': 7,
                         'Underwriting data, claims processing information, risk assessment models, and policyholder demographics.': 5,
                         'Union membership statistics, collective bargaining data, labor rights advocacy, and workplace safety metrics.': 8,
                         'Vehicle safety testing results, autonomous driving research data, electric vehicle adoption statistics, and auto show information.': 16,
                         'Vessel performance data, cargo tracking, safety records, and regulatory compliance.': 6,
                         'Visitor demographics, exhibition analytics, community engagement metrics, and digital museum trends.': 10,
                         'Waste generation metrics, recycling rates, landfill capacity data, and circular economy initiatives.': 16,
                         'Water usage metrics, drought impact assessments, wastewater treatment data, and water conservation initiatives.': 5,
                         'Workout data, membership demographics, wearable technology metrics, and wellness trends.': 19},
  'sql': {'ALTER TABLE policyholders ADD CONSTRAINT age_range CHECK (age >= 1 AND age <= 120);': 1,
          'CREATE TABLE Archaeologists (ArchaeologistID INT PRIMARY KEY, FirstName VARCHAR(255), LastName VARCHAR(255), Specialty TEXT, Country VARCHAR(255));': 1,
          'CREATE TABLE ai_ethics (id INT PRIMARY KEY, initiative VARCHAR(50), organization VARCHAR(50), region VARCHAR(50), start_date DATE, end_date DATE, budget FLOAT);': 1,
          'CREATE TABLE artifacts (id INT, artifact_type VARCHAR(255), material VARCHAR(255), analysis_date DATE);': 1,
          'CREATE TABLE infection_rates (id INT PRIMARY KEY, state VARCHAR(50), infection_rate FLOAT);': 1,
          'CREATE TABLE language_revitalization (id INT PRIMARY KEY, language VARCHAR(50), program_name VARCHAR(100), location VARCHAR(50), start_year INT, end_year INT);': 1,
          'CREATE TABLE ocean_species (id INT PRIMARY KEY, species VARCHAR(100), population INT, region VARCHAR(50));': 1,
          'CREATE TABLE player_demographics_new AS SELECT * FROM player_demographics WHERE 1=2;': 1,
          'CREATE TABLE training_programs (id INT PRIMARY KEY, program_name VARCHAR(50), start_date DATE, end_date DATE, department VARCHAR(50), trainer VARCHAR(50));': 1,
          "CREATE VIEW female_fans AS SELECT * FROM fans WHERE gender = 'Female';": 1,
          "CREATE VIEW mental_health_parity_view AS SELECT m.state, m.mental_health_coverage, m.substance_use_coverage, c.cultural_competency_training FROM mental_health_parity m JOIN cultural_competency c ON m.state = c.state; WITH summary AS (SELECT state, mental_health_coverage, substance_use_coverage, cultural_competency_training, CASE WHEN mental_health_coverage = 'Yes' AND substance_use_coverage = 'Yes' AND cultural_competency_training = 'Yes' THEN 'Parity and Competency' ELSE 'No Parity or Competency' END as result FROM mental_health_parity_view) SELECT * FROM summary;": 1,
          'CREATE VIEW public_transportation_by_location AS SELECT location, GROUP_CONCAT(name) as transportation_systems FROM public_transportation GROUP BY location;': 1,
          'DELETE FROM Artworks WHERE Artist IN (SELECT Artist FROM Artworks GROUP BY Artist HAVING COUNT(Artwork) < 2)': 1,

In [19]:

results_4 = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).num_words_per_record()
pprint(results_4)

{'average_words_per_record': 13.046100000000001,
 'word_counts_per_column': {'domain': 1.687,
                            'domain_description': 13.197,
                            'sql': 15.635,
                            'sql_complexity': 1.694,
                            'sql_complexity_description': 8.028,
                            'sql_context': 32.493,
                            'sql_explanation': 35.021,
                            'sql_prompt': 13.867,
                            'sql_task_type': 2.896,
                            'sql_task_type_description': 5.943}}

In [22]:
results = BaseEvaluationTaskSuite(llm_suite, dataset_1000_pd).evaluate_all()
pprint(results)

{'feature_cardinality': {'domain': 0.1,
                         'domain_description': 0.1,
                         'id': 1.0,
                         'sql': 1.0,
                         'sql_complexity': 0.008,
                         'sql_complexity_description': 0.008,
                         'sql_context': 0.996,
                         'sql_explanation': 1.0,
                         'sql_prompt': 1.0,
                         'sql_task_type': 0.004,
                         'sql_task_type_description': 0.004},
 'feature_distribution': ({'domain': {'aerospace': 6,
                                      'agriculture': 8,
                                      'aquaculture': 15,
                                      'archeology': 8,
                                      'arctic research': 4,
                                      'artificial intelligence': 12,
                                      'arts and culture': 8,
                                      'arts operations and management': 15,
                                      'automotive': 16,
                                      'beauty industry': 11,
                                      'biotechnology': 11,
                                      'blockchain': 6,
                                      'cannabis industry': 7,
                                      'charitable organizations': 15,
                                      'chemicals': 9,
                                      'civil engineering': 9,
                                      'climate change': 12,
                                      'construction': 17,
                                      'cosmetics': 4,
                                      'cultural preservation': 8,
                                      'cybersecurity': 13,
                                      'defense contractors': 5,
                                      'defense industry': 9,
                                      'defense operations': 13,
                                      'defense security': 16,
                                      'disability services': 11,
                                      'education': 9,
                                      'energy': 8,
                                      'entertainment industry': 9,
                                      'ethical fashion': 18,
                                      'fashion': 7,
                                      'fashion retail': 7,
                                      'finance': 8,
                                      'financial services': 12,
                                      'fine arts': 14,
                                      'fitness industry': 19,
                                      'food industry': 15,
                                      'food services': 10,
                                      'forestry': 9,
                                      'gaming industry': 7,
                                      'gaming technology': 14,
                                      'government policy': 15,
                                      'government services': 13,
                                      'healthcare': 13,
                                      'higher education': 15,
                                      'hospitality': 9,
                                      'hospitality technology': 10,
                                      'human resources': 9,
                                      'humanitarian aid': 4,
                                      'insurance': 5,
                                      'journalism': 8,
                                      'justice': 6,
                                      'legal services': 7,
                                      'logistics': 10,
                                      'manufacturing': 13,
                                      'marine biology': 6,
                                      'maritime': 6,
                                      'media': 11,
                                      'mental health': 9,
                                      'mining industry': 7,
                                      'mining operations': 10,
                                      'museums': 10,
                                      'music': 6,
                                      'music industry': 5,
                                      'nonprofit': 9,
                                      'nonprofit operations': 9,
                                      'ocean shipping': 9,
                                      'oceanography': 13,
                                      'oceans': 9,
                                      'oil and gas': 12,
                                      'pharmaceuticals': 6,
                                      'philanthropy': 11,
                                      'precision agriculture': 10,
                                      'public health': 16,
                                      'public safety': 11,
                                      'public transportation': 11,
                                      'rare earth elements': 8,
                                      'real estate': 15,
                                      'restaurant operations': 18,
                                      'retail': 11,
                                      'rural development': 14,
                                      'rural health': 12,
                                      'social impact investing': 3,
                                      'social media': 4,
                                      'space': 17,
                                      'space exploration': 5,
                                      'sports': 11,
                                      'sports entertainment': 8,
                                      'startups': 5,
                                      'sustainable energy': 8,
                                      'sustainable infrastructure': 16,
                                      'technology': 5,
                                      'telecommunications': 9,
                                      'tourism': 6,
                                      'trade unions': 8,
                                      'transportation': 11,
                                      'venture capital': 10,
                                      'waste management': 16,
                                      'water resources': 5,
                                      'wildlife conservation': 8},
                           'domain_description': {'AI data on algorithmic fairness, AI safety, explainable AI, and creative AI applications.': 12,
                                                  'Agricultural innovation metrics, rural infrastructure projects, community development initiatives, and economic diversification efforts.': 14,
                                                  'Aircraft manufacturing data, satellite deployment projects, flight safety records, and space exploration research.': 6,
                                                  'Animal population data, habitat preservation efforts, and community education programs.': 8,
                                                  'Aquatic farming data, fish stock management, ocean health metrics, and sustainable seafood trends.': 15,
                                                  'Audience demographics, event attendance, program impact, and funding sources.': 8,
                                                  'Audience demographics, viewership trends, content ratings, production budgets, and marketing strategies for movies, TV shows, and music.': 9,
                                                  'Building permit data, construction labor statistics, project timeline information, and sustainable building practices.': 17,
                                                  'Cannabis production data, dispensary sales stats, regulatory compliance metrics, and social equity trends.': 7,
                                                  'Case outcomes, legal precedents, attorney performance metrics, client demographics, and billing information.': 7,
                                                  'Chemical manufacturing data, safety protocols, environmental impact assessments, and product innovation metrics.': 9,
                                                  'Climate change data on climate mitigation, climate adaptation, climate finance, and climate communication.': 12,
                                                  'Clinical trial outcomes, drug approval data, sales figures, R&D expenditures, and market access strategies.': 6,
                                                  'Community health statistics, infectious disease tracking data, healthcare access metrics, and public health policy analysis.': 16,
                                                  'Company founding data, funding records, diversity metrics, and innovation trends.': 5,
                                                  'Company founding data, investment rounds, exit strategies, and diversity metrics in the startup ecosystem.': 10,
                                                  'Comprehensive data on agroecology, food justice, indigenous food systems, and urban agriculture.': 8,
                                                  'Comprehensive data on disability accommodations, support programs, policy advocacy, and inclusion efforts in disability services.': 11,
                                                  'Comprehensive data on marine species, oceanography, conservation efforts, and climate change impacts in marine biology.': 6,
                                                  'Comprehensive data on smart contracts, decentralized applications, digital assets, and regulatory frameworks in blockchain.': 6,
                                                  'Comprehensive data on sustainable forest management, timber production, wildlife habitat, and carbon sequestration in forestry.': 9,
                                                  'Consumer preference data, ingredient sourcing information, product safety records, and cruelty-free certification metrics.': 4,
                                                  'Cosmetics sales data, beauty product ingredient transparency, consumer preferences, and sustainability metrics.': 11,
                                                  'Crime statistics, emergency response times, community policing metrics, and disaster preparedness data.': 11,
                                                  'Data on art collections, cultural event attendance, artist demographics, museum operations, and heritage preservation efforts.': 15,
                                                  'Defense contract data, military equipment maintenance, threat intelligence metrics, and veteran employment stats.': 9,
                                                  'Defense data on military innovation, peacekeeping operations, defense diplomacy, and humanitarian assistance.': 13,
                                                  'Detailed financial data including investment strategies, risk management, fraud detection, customer analytics, and regulatory compliance.': 12,
                                                  'Detailed records on cargo handling, fleet management, port operations, and regulatory compliance in ocean shipping.': 9,
                                                  'Detailed records on ethical manufacturing, circular economy, workforce development, and industry 4.0.': 13,
                                                  'Detailed records on excavation sites, artifact analysis, historical context, and public outreach in archeology.': 8,
                                                  'Detailed records on healthcare access, disease prevalence, and resource allocation in rural health.': 12,
                                                  'Detailed records on investment strategies, risk assessment, impact measurement, and ESG (Environmental, Social, and Governance) factors in social impact investing.': 3,
                                                  'Detailed records on military technology, intelligence operations, national security, and cybersecurity strategies.': 16,
                                                  'Detailed records on music creation, distribution, marketing, and consumption patterns across various genres and platforms.': 6,
                                                  'Donation records, program outcomes, volunteer engagement metrics, budget reports, and community impact assessments.': 9,
                                                  'Education data on student mental health, teacher professional development, open pedagogy, and lifelong learning.': 9,
                                                  'Employee demographics, talent acquisition data, diversity and inclusion metrics, and training program statistics.': 9,
                                                  'Energy market data covering renewable energy sources, energy storage, carbon pricing, and energy efficiency.': 8,
                                                  'Exploration data, production figures, infrastructure development, and market trends.': 12,
                                                  'Extensive data on athlete performance, team management, fan engagement, facility operations, and event planning in sports.': 11,
                                                  'Extensive data on disaster response, refugee support, community development, and advocacy in humanitarian aid.': 4,
                                                  'Extensive data on ethical AI, technology for social good, digital divide, and technology accessibility.': 5,
                                                  'Extensive data on route planning, fare collection, vehicle maintenance, and accessibility in public transportation.': 11,
                                                  'Extensive data on sustainable materials, fair labor practices, circular economy, and consumer awareness in ethical fashion.': 18,
                                                  'Extensive data on user behavior, content trends, advertising performance, and data privacy in social media.': 4,
                                                  'Fashion trend data, textile sourcing info, customer size diversity, and sustainable fashion metrics.': 7,
                                                  'Financial data on Shariah-compliant finance, socially responsible lending, financial capability, and financial wellbeing.': 8,
                                                  'Financial data, program impact, donor demographics, and volunteer management.': 15,
                                                  'Food safety records, nutrition data, supply chain transparency, and sustainable food trends.': 15,
                                                  'Freight forwarding data, warehouse management statistics, route optimization information, and reverse logistics metrics.': 10,
                                                  'Genetic research data, bioprocess engineering information, biotech startup funding, and biosensor technology development.': 11,
                                                  'Government data on open data initiatives, public participation, evidence-based policy making, and government transparency.': 15,
                                                  'Graduate student records, research grant data, academic publishing statistics, and faculty diversity metrics.': 15,
                                                  'Green building data, renewable energy infrastructure projects, carbon offset initiatives, and smart city technology adoption.': 16,
                                                  'Healthcare data on mental health parity, cultural competency, health equity metrics, and community health workers.': 13,
                                                  'Hospitality data on sustainable tourism, cultural heritage preservation, virtual tourism, and local economic impact.': 9,
                                                  'Hotel tech adoption metrics, online travel agency data, virtual tour engagement stats, and hospitality AI trends.': 10,
                                                  'In-depth data on art history, curation, exhibition, and cultural impact in the fine arts.': 14,
                                                  'In-depth data on climate change, biodiversity, indigenous communities, and resource management in arctic research.': 4,
                                                  'In-depth data on heritage sites, traditional arts, language preservation, and community engagement in cultural preservation.': 8,
                                                  'In-depth data on mental health conditions, treatment approaches, patient outcomes, and public awareness campaigns in mental health.': 9,
                                                  'Infrastructure development data, engineering design standards, public works project information, and resilience metrics.': 9,
                                                  'International visitor statistics, travel advisory information, destination marketing data, and sustainable tourism practices.': 6,
                                                  'Justice data on restorative justice, access to justice, criminal justice reform, and legal technology.': 6,
                                                  'Marine life research data, ocean floor mapping projects, pollution control initiatives, and maritime law compliance.': 13,
                                                  'Media data on content diversity, media literacy, disinformation detection, and media representation.': 11,
                                                  'Menu engineering, customer preferences, inventory management, and sustainability initiatives.': 10,
                                                  'Military equipment sales data, defense project timelines, contract negotiations, and geopolitical risk assessments.': 5,
                                                  'Mineral extraction statistics, environmental impact assessments, labor productivity metrics, and geological survey information.': 7,
                                                  'Mining operation data, environmental impact stats, workforce diversity, and resource depletion metrics.': 10,
                                                  'Mobile and broadband subscriber data, network infrastructure investments, customer usage patterns, and regulatory compliance information.': 9,
                                                  'Music streaming data, concert ticket sales, artist demographics, and music festival trends.': 5,
                                                  'News reporting data, audience demographics, media ethics information, and investigative journalism projects.': 8,
                                                  'Nonprofit data on charitable giving trends, social impact assessment, capacity building, and volunteer management.': 9,
                                                  'Ocean data on marine conservation, ocean acidification, deep-sea exploration, and maritime safety.': 9,
                                                  'Philanthropy data on effective altruism, impact investing, philanthropic trends, and donor demographics.': 11,
                                                  'Player analytics, game performance metrics, eSports data, and virtual reality trends.': 7,
                                                  'Player demographics, game design data, esports event information, and virtual reality technology adoption.': 14,
                                                  'Precision farming data, satellite imagery analysis, IoT sensor metrics, and agricultural automation trends.': 10,

In [ ]:
results = NL2PythonEvaluationTaskSuite(llm_suite, dataset_1000_pd, code_lang="python").evaluate_all()
pprint(results)

### Testing LLM-as-a-Judge Evaluation

In [28]:
dataset_10_pd = dataset_1000_pd.head(10)

In [ ]:
if code_lang == "sql":
    task_5 = NL2SQLEvaluationTaskSuite(
        llm_suite=llm_suite, dataset=dataset_10_pd, code_lang="sql"
    )
elif code_lang == "python":
    task_5 = NL2PythonEvaluationTaskSuite(
        llm_suite=llm_suite, dataset=dataset_10_pd, code_lang="python"
    )
else:
    task_5 = BaseEvaluationTaskSuite(llm_suite, dataset_10_pd)
results_5 = task_5.llm_as_a_judge_evaluation(**eval_kwargs)
table_5 = task_5.output_dataset

In [ ]:
print(results_5)
table_5.head()